Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The GetKeyName function retrieves the name or text of a key.
ja: GetKeyName 関数は、キーの名前またはテキストを取得します。

source: The GetKeyName function retrieves the name/text of a key.
ja: GetKeyName関数は、キーの名前またはテキストを取得します。

source: The GetKeySC function retrieves the scan code of a key.
ja: GetKeySC関数は、キーのスキャンコードを取得します。

source: The GetKeyState function checks if a keyboard key or mouse/joystick button is down or up.
ja: GetKeyState関数は、キーボードキーやマウス・ジョイスティックボタンがダウンしているかアップしているかをチェックします。

source: The GetKeyVK function retrieves the virtual key code of a key.
ja: GetKeyVK 関数は、ある鍵の仮想鍵コードを取得します。

source: The GetMethod function retrieves the implementation function of a method.
ja: GetMethod 関数は、メソッドの実装関数を取得します。

source: The Google Safe Browsing service (also used by other browsers) has been known to show false warnings about AutoHotkey.
ja: Googleセーフブラウジングサービス（他のブラウザでも使用されています）では、AutoHotkeyに関する誤った警告を表示することが知られています。

source: The Goto statement jumps to the specified label and continues execution.
ja: Goto文は、指定されたラベルにジャンプして実行を継続します。

source: The GroupActivate function activates the next window in a window group that was defined with the GroupAdd function.
ja: GroupActivate関数は、GroupAdd関数で定義されたウィンドウグループの中の次のウィンドウをアクティブにします。

source: The GroupAdd function adds a window specification to a window group, creating the group if necessary.
ja: GroupAdd 関数は、ウィンドウの仕様をウィンドウグループに追加し、必要に応じてグループを作成します。

source: The GroupClose function closes the active window if it was just activated by the GroupActivate or GroupDeactivate function.
ja: GroupClose関数は、GroupActivate関数またはGroupDeactivate関数によってアクティブになったウィンドウを閉じます。

source: The GroupDeactivate function is similar to the GroupActivate function but activates the next window not in the group.
ja: GroupDeactivate 関数は、GroupActivate 関数と似ていますが、グループに属さない次のウィンドウをアクティブにします。

source: The Gui object provides an interface for a GUI window to perform actions, such as adding new controls, or to retrieve or set values, such as colors.
ja: Guiオブジェクトは、GUIウィンドウが新しいコントロールを追加するなどのアクションを実行したり、色などの値を取得または設定するためのインターフェースを提供します。

source: The Gui object provides an interface to create a window, add controls, modify the window, and retrieve information about the window.
ja: Guiオブジェクトは、ウィンドウを作成したり、コントロールを追加したり、ウィンドウを変更したり、ウィンドウの情報を取得したりするためのインターフェースを提供します。

source: The GuiControl object provides an interface for a GUI control to perform actions, such as moving, or to retrieve or set values, such as its text.
ja: GuiControlオブジェクトは、GUIコントロールが移動などの動作を行ったり、テキストなどの値を取得・設定したりするためのインターフェースを提供します。

source: The GuiCtrlFromHwnd function retrieves the GuiControl object of a GUI control associated with the specified HWND.
ja: GuiCtrlFromHwnd関数は、指定されたHWNDに関連付けられたGUIコントロールのGuiControlオブジェクトを取得します。

source: The GuiCtrlFromHwnd function retrieves the GuiControl object of a GUI control associated with the specified window handle.
ja: GuiCtrlFromHwnd関数は、指定されたウィンドウハンドルに関連付けられているGUIコントロールのGuiControlオブジェクトを取得します。

source: The GuiFromHwnd function retrieves the Gui object of a GUI window associated with the specified HWND.
ja: GuiFromHwnd関数は、指定されたHWNDに関連付けられたGUIウィンドウのGuiオブジェクトを取得します。

source: The GuiFromHwnd function retrieves the Gui object of a GUI window associated with the specified window handle.
ja: GuiFromHwnd関数は、指定されたウィンドウハンドルに関連付けられているGUIウィンドウのGuiオブジェクトを取得します。

source: The HWND (unique ID) of the window or control to which the message was sent.
ja: メッセージの送信先のウィンドウまたはコントロールのHWND（ユニークID）です。

source: The HWND can be used directly in a WinTitle parameter.
ja: HWNDは、WinTitleパラメータで直接使用することができます。

source: The HWND can identify a control or a top-level window, though the latter is usually only meaningful for a select few functions (see below).
ja: HWNDはコントロールやトップレベルのウィンドウを識別することができますが、後者は通常、一部の機能でしか意味を持ちません（下記参照）。

source: The HasBase function returns a non-zero number if the specified value is derived from the specified base object.
ja: HasBase 関数は、指定された値が指定されたベースオブジェクトから派生したものである場合、0 以外の数値を返す。

source: The HasMethod function returns a non-zero number if the specified value has a method by the specified name.
ja: HasMethod 関数は、指定された値が指定された名前のメソッドを持つ場合に、0 以外の数値を返します。

source: The HasProp function returns a non-zero number if the specified value has a property by the specified name.
ja: HasProp 関数は、指定された値が指定された名前のプロパティを持つ場合に、0 以外の数値を返す。

source: The HotIf function specifies the criteria for subsequently created or modified hotkey variants.
ja: HotIf機能は、その後に作成または変更されるホットキーバリアントの基準を指定します。

source: The HotIf function uses the string that you pass to it, not the original source code.
ja: HotIf関数は、元のソースコードではなく、渡した文字列を使用します。

source: The Hotkey function can also modify, disable, or enable the script's existing hotkeys individually.
ja: また、ホットキー機能は、スクリプトの既存のホットキーを個別に変更、無効化、有効化することができます。

source: The Hotkey function creates, modifies, enables, or disables a hotkey while the script is running.
ja: Hotkey関数は、スクリプトの実行中にホットキーを作成、変更、有効化、または無効化する機能です。

source: The Hotstring function creates, modifies, enables, or disables a hotstring while the script is running.
ja: Hotstring機能は、スクリプトの実行中にHotstringを作成、変更、有効化、無効化する機能です。

source: The ID number of the item whose text to be retrieved.
ja: テキストを取得する項目のID番号。

source: The ID number of the item, whose text to be retrieved.
ja: テキストを取得する項目のID番号。

source: The ID number of the new item's parent (omit it or specify 0 to add the item at the top level).
ja: 新しいアイテムの親のID番号（省略するか、アイテムをトップレベルに追加する場合は0を指定する）。

source: The ID of a ImageList created by IL_Create.
ja: IL_Createで作成された ImageList の ID。

source: The ID of a control is typically retrieved via ControlGetHwnd, MouseGetPos, or DllCall.
ja: コントロールのIDは通常、ControlGetHwnd、MouseGetPos、またはDllCallで取得します。

source: The ID of a window is typically retrieved via WinExist or WinGetID.
ja: ウィンドウのIDは通常、WinExistまたはWinGetIDで取得する。

source: The ID of a window's process can be revealed via Window Spy.
ja: ウィンドウのプロセスIDは、ウィンドウ・スパイで知ることができる。

source: The ID of the clicked item, or 0 if the mouse was not over an item.
ja: クリックされた項目のID、またはマウスが項目上にない場合は0を指定します。

source: The ID of the window or control under the mouse cursor can be retrieved with MouseGetPos.
ja: まｓマウスカーソルの下にあるウィンドウまたはコントロールのIDは、MouseGetPos関数で取得できます。

source: The ID of the window under the mouse cursor can be retrieved with MouseGetPos.
ja: マウスカーソルの下にあるウィンドウのIDは、MouseGetPos関数で取得できます。

source: The IProvideClassInfo interface is used to retrieve type information about the object's class if the object supports it.
ja: IProvideClassInfo インターフェースは、オブジェクトがクラスをサポートしている場合、そのクラスに関する型情報を取得するために使用されます。

source: The ISO 8601 full year and week number.
ja: ISO 8601の完全な年号と週番号を示します。

source: The If statement specifies one or more statements to execute if an expression evaluates to true.
ja: If文は、ある式がtrueと評価された場合に実行する1つまたは複数の文を指定します。

source: The ImageSearch function searches a region of the screen for an image.
ja: イメージサーチ機能は、画面上のある領域を検索して画像を探す機能です。

source: The InStr function searches for a given occurrence of a string, from the left or the right.
ja: InStr関数は、文字列の左または右から、指定された出現箇所を検索します。

source: The IniDelete function deletes a value from a standard format .ini file.
ja: IniDelete関数は、標準フォーマットの .ini ファイルから値を削除します。

source: The IniRead function reads a value, section or list of section names from a standard format .ini file.
ja: IniRead関数は、標準フォーマットの.iniファイルから値、セクション、またはセクション名のリストを読み取ります。

source: The IniWrite function writes a value or section to a standard format .ini file.
ja: IniWrite関数は、標準フォーマットの .ini ファイルに値またはセクションを書き込みます。

source: The Input command blocks both text and non-text keystrokes by default, and blocks neither if the V option is present.
ja: Inputコマンドは、デフォルトでテキストと非テキストの両方のキーストロークをブロックし、Vオプションが存在する場合はどちらもブロックしません。

source: The Input command blocks the thread while it is in progress, whereas InputHook allows the thread to continue, or even exit (which allows any thread that it interrupted to resume).
ja: Inputコマンドは進行中のスレッドをブロックするのに対し、InputHookはスレッドを継続、あるいは終了（中断したスレッドを再開させる）させることができます。

source: The Input command limits the length of the input to 16383, while InputHook limits it to 1023.
ja: Inputコマンドは入力の長さを16383に制限し、InputHookは1023に制限しています。

source: The Input command returns the user's input only after the Input is terminated, whereas InputHook's Input property allows it to be retrieved at any time.
ja: InputコマンドはInputが終了した後にしかユーザーの入力を返さないが、InputHookのInputプロパティはいつでも取得できます。

source: The Input command stores end keys A-Z in uppercase even though other letters on some keyboard layouts are lowercase.
ja: Inputコマンドは、キーボードレイアウトによっては他の文字が小文字であっても、エンドキーA-Zを大文字で保存します。

source: The Input command terminates any previous Input which it started, whereas InputHook allows more than one Input at a time.
ja: Inputコマンドは、開始した前のInputを終了させますが、InputHookは、一度に複数のInputを行うことができます。

source: The Input command was removed for v2.0, but the code below is mostly equivalent:
ja: Inputコマンドはv2.0で削除されましたが、以下のコードはほぼ同等です：

source: The Input matches one of the items in MatchList.
ja: InputがMatchListの項目の1つに一致します。

source: The Input reached the maximum allowed length and it does not match any of the items in MatchList.
ja: Inputが最大許容長に達し、MatchListの、どの項目とも一致しない。

source: The Input timed out.
ja: 入力のタイムアウト。

source: The InputBox function displays an input box to ask the user to enter a string.
ja: InputBox関数は、文字列の入力を求める入力ボックスを表示する関数です。

source: The InputHook function creates an object which can be used to collect or intercept keyboard input.
ja: InputHook関数は、キーボード入力の収集や傍受に使用できるオブジェクトを作成します。

source: The InputHook function returns an InputHook object, which has the following methods and properties.
ja: InputHook関数は、以下のメソッドとプロパティを持つInputHookオブジェクトを返します。

source: The InstallKeybdHook function installs or uninstalls the keyboard hook.
ja: InstallKeybdHook 関数は、キーボードフックのインストールまたはアンインストールを行います。

source: The InstallMouseHook function installs or uninstalls the mouse hook.
ja: InstallMouseHook関数は、マウスフックをインストールまたはアンインストールします。

source: The Integer function converts a numeric string or floating-point value to an integer.
ja: Integer関数は、数値文字列または浮動小数点値を整数に変換する関数です。

source: The IsLabel function returns a non-zero number if the specified label exists in the current scope.
ja: IsLabel関数は、指定されたラベルが現在のスコープに存在する場合、0以外の数値を返します。

source: The IsObject function returns a non-zero number if the specified value is an object.
ja: IsObject 関数は、指定された値がオブジェクトである場合、0以外の数値を返す。

source: The IsSet operator and IsSetRef function return a non-zero number if the specified variable has been assigned a value.
ja: IsSet 演算子および IsSetRef 関数は、指定された変数に値が割り当てられている場合、0 以外の数値を返します。

source: The KeyHistory function displays script info and a history of the most recent keystrokes and mouse clicks.
ja: KeyHistory機能は、スクリプト情報と直近のキー操作やマウスクリックの履歴を表示する機能です。

source: The KeyWait function waits for a key or mouse/joystick button to be released or pressed down.
ja: KeyWait機能は、キーやマウス・ジョイスティックのボタンが離されたり押し下げられたりするのを待つ機能です。

source: The ListHotkeys function displays the hotkeys in use by the current script, whether their subroutines are currently running, and whether they use a hook.
ja: ListHotkeys関数は、現在のスクリプトで使用されているホットキー、そのサブルーチンが現在実行されているかどうか、フックを使用しているかどうかを表示します。

source: The ListLines function enables or disables line logging or displays the script lines most recently executed.
ja: ListLines関数は、ログをとるのを有効または無効にしたり、最近実行されたスクリプトの行を表示したりします。

source: The ListVars function displays the script's variables:
ja: ListVars関数は、スクリプトの変数を表示します：

source: The ListVars function displays the script's variables: their names and current contents.
ja: ListVars関数は、スクリプトの変数を表示します：その名前と現在の内容です。

source: The ListViewGetContent function returns a list of items/rows from a ListView.
ja: ListViewGetContent関数は、ListViewから項目/列のリストを返します。

source: The LoadPicture function loads a picture from file and returns a bitmap or icon handle.
ja: LoadPicture 関数は、ファイルから画像をロードし、ビットマップまたはアイコンハンドルを返します。

source: The Loop Files statement retrieves the specified files or folders, one at a time.
ja: Loop Filesステートメントは、指定されたファイルまたはフォルダを1つずつ取得します。

source: The Loop Parse statement retrieves substrings (fields) from a string, one at a time.
ja: Loop Parse文は、文字列から部分文字列（フィールド）を1つずつ取得します。

source: The Loop Read statement retrieves the lines in a text file, one at a time.
ja: Loop Read文は、テキストファイルの行を1行ずつ取得します。

source: The Loop Reg statement retrieves the contents of the specified registry subkey, one item at a time.
ja: Loop Regは、指定したレジストリサブキーの内容を1項目ずつ取得します。

source: The Loop statement performs a series of code lines repeatedly:
ja: Loop文は、一連のコード行を繰り返し実行します：

source: The M option might cause some keyboard shortcuts such as Ctrl+← to misbehave while an Input is in progress.
ja: Mオプションを使用すると、入力中にCtrl+←などの一部のキーボードショートカットが誤動作する場合があります。

source: The Menu/MenuBar object provides an interface for menus or menu bars to perform actions, such as adding menu items, or to retrieve or set values, such as the default menu item.
ja: Menu/MenuBar オブジェクトは、メニューやメニューバーがメニュー項目の追加などのアクションを実行したり、デフォルトのメニュー項目などの値を取得または設定するためのインターフェースを提供します。

source: The MenuFromHandle function retrieves the Menu or MenuBar object corresponding to a Win32 menu handle.
ja: MenuFromHandle関数は、Win32 メニューハンドルに対応する Menu または MenuBar オブジェクトを取得します。

source: The MenuSelect function invokes a menu item from the menu bar of the specified window.
ja: MenuSelect関数は、指定されたウィンドウのメニューバーからメニュー項目を呼び出します。

source: The MonitorGet function checks if the specified monitor exists and optionally retrieves its bounding coordinates.
ja: MonitorGet 関数は、指定されたモニターが存在するかどうかを確認し、オプションでその境界座標を取得するものです。

source: The MonitorGetCount function returns the total number of monitors.
ja: MonitorGetCount関数は、モニターの総数を返します。

source: The MonitorGetName function returns the operating system's name of the specified monitor.
ja: MonitorGetName関数は、指定されたモニターのOS上の名前を返します。

source: The MonitorGetPrimary function returns the number of the primary monitor.
ja: MonitorGetPrimary関数は、プライマリモニタの番号を返します。

source: The MonitorGetWorkArea function checks if the specified monitor exists and optionally retrieves the bounding coordinates of its working area.
ja: MonitorGetWorkArea関数は、指定されたモニターが存在するかどうかをチェックするとともに、副次的にその作業領域の境界の座標を取得します。

source: The MouseClick function clicks or holds down a mouse button, or turns the mouse wheel.
ja: MouseClick機能は、マウスボタンのクリックや長押し、マウスホイールの回転を行う機能です。

source: The MouseClickDrag function clicks and holds the specified mouse button, moves the mouse to the destination coordinates, then releases the button.
ja: MouseClickDrag 関数は、指定されたマウスボタンをクリックしたまま、移動先の座標にマウスを移動し、ボタンを離すものです。

source: The MouseGetPos function retrieves the current position of the mouse cursor, and optionally which window and control it is hovering over.
ja: MouseGetPos関数は、マウスカーソルの現在位置を取得します。また、オプションでどのウィンドウとコントロール上にカーソルがあるのかを取得します。

source: The MouseMove function moves the mouse cursor.
ja: MouseMove関数は、マウスカーソルを移動させます。

source: The MsgBox function displays the specified text in a small window containing one or more buttons (such as Yes and No).
ja: MsgBox 関数は、指定されたテキストを、1 つまたは複数のボタン（Yes や No など）を含む小さなウィンドウに表示します。

source: The New Script GUI can be accessed via the dash or by right-clicking within a folder in Explorer and selecting New → AutoHotkey Script.
ja: 新規スクリプトGUIは、Dashボタンからアクセスするか、エクスプローラでフォルダ内を右クリックし、新規作成 → AutoHotkeyスクリプトを選択することで表示されます。

source: The Notepad example can be rewritten to take advantage of this:
ja: メモ帳の例は、これを利用するために書き換えることができます：

source: The NumGet function returns the binary number stored at the specified address+offset.
ja: NumGet関数は、指定されたアドレス＋オフセットに格納されている2進数を返します。

source: The NumPut function stores one or more numbers in binary format at the specified address+offset.
ja: NumPut関数は、指定されたアドレス+オフセットに1つ以上の数値をバイナリ形式で格納します。

source: The Number function converts a numeric string to a pure integer or floating-point number.
ja: Number関数は、数値文字列を整数または浮動小数点数に変換します。

source: The ObjAddRef and ObjRelease functions increment or decrement an object's reference count.
ja: ObjAddRef関数とObjRelease関数は、オブジェクトの参照カウントをインクリメントまたはデクリメントします。

source: The ObjBindMethod function creates a BoundFunc object which calls a method of a given object.
ja: ObjBindMethod関数は、与えられたオブジェクトのメソッドを呼び出すBoundFuncオブジェクトを作成します。

source: The Object class defines new methods for dealing with properties and methods:
ja: Objectクラスは、プロパティとメソッドを扱うための新しいメソッドを定義しています：

source: The Object class defines new methods for dealing with properties and methods: DefineProp, DeleteProp, GetOwnPropDesc, HasOwnProp, OwnProps.
ja: Objectクラスは、プロパティとメソッドを扱うための新しいメソッドを定義しています：DefineProp、DeleteProp、GetOwnPropDesc、HasOwnProp、OwnProps。

source: The OnClipboardChange function causes the specified function to be called automatically whenever the clipboard's content changes.
ja: OnClipboardChange関数は、クリップボードの内容が変更されるたびに、指定された関数が自動的に呼び出されるようにするものです。

source: The OnClipboardChange function registers a function to be called automatically whenever the clipboard's content changes.
ja: OnClipboardChange関数は、クリップボードの内容が変更されるたびに自動的に呼び出される関数を登録します。

source: The OnClipboardChange label is no longer called automatically if it exists.
ja: OnClipboardChangeラベルが存在する場合、自動的に呼び出されることはなくなりました。

source: The OnCommand method of a GuiControl object registers a function or method to be called when a control notification is received via the WM_COMMAND message.
ja: GuiControlオブジェクトのOnCommandメソッドは、WM_COMMANDメッセージで制御通知を受け取ったときに呼び出される関数やメソッドを登録します。

source: The OnError function causes the specified function to be called automatically when an unhandled error occurs.
ja: OnError 関数は、処理されないエラーが発生したときに、指定された関数が自動的に呼び出されるようにする。

source: The OnEvent method of a Gui or GuiControl object registers a function or method to be called when the given event is raised by a GUI window or control.
ja: GuiまたはGuiControlオブジェクトのOnEventメソッドは、GUIウィンドウまたはコントロールによって与えられたイベントが発生したときに呼び出される関数またはメソッドを登録します。

source: The OnExit thread does not obey #MaxThreads (it will always launch when needed).
ja: OnExitスレッドは #MaxThreadsに従いません（必要なときに常に起動します）。

source: The OnExit command has been removed; use the OnExit function which was added in v1.1.20 instead.
ja: OnExitコマンドは削除されました。代わりにv1.1.20で追加されたOnExit関数を使用してください。

source: The OnExit function causes the specified function to be called automatically when the script exits.
ja: OnExit関数は、スクリプトの終了時に指定された関数が自動的に呼び出されるようにするものです。

source: The OnMessage function causes the specified function to be called automatically whenever the script receives the specified message.
ja: OnMessage関数は、スクリプトが指定されたメッセージを受信するたびに、指定された関数が自動的に呼び出されるようにします。

source: The OnNotify method of a GuiControl object registers a function or method to be called when a control notification is received via the WM_NOTIFY message.
ja: GuiControlオブジェクトのOnNotifyメソッドは、WM_NOTIFYメッセージで制御通知を受信したときに呼び出す関数やメソッドを登録するものです。

source: The One True Brace (OTB) style may optionally be used, which allows the open-brace to appear on the same line rather than underneath.
ja: オプションで、オープンブレースを下ではなく同じラインに表示させるOTB（One True Brace）スタイルを採用することも可能です。

source: The Ord function returns the ordinal value (numeric character code) of the first character in the specified string.
ja: Ord関数は、指定された文字列の最初の文字の序列値（数値文字コード）を返します。

source: The OutputDebug function sends a string to the debugger (if any) for display.
ja: OutputDebug関数は、デバッガ（もしあれば）に表示するための文字列を送信します。

source: The PID of a newly launched process can be determined via the Run function.
ja: 新しく立ち上げたプロセスのPIDは、Run関数で決定することができます。

source: The Pause function pauses the script's current thread or sets the pause state of the underlying thread.
ja: Pause関数は、現在のスレッドを一時停止、または基礎となるスレッドの停止状態を設定します。

source: The Pause function pauses the script's current thread.
ja: Pause 関数は、スクリプトの現在のスレッドを一時停止します。

source: The Persistent function prevents the script from exiting automatically when its last thread completes, allowing it to stay running in an idle state.
ja: Persistent関数は、最後のスレッドが完了したときにスクリプトが自動的に終了するのを防ぎ、アイドル状態で実行し続けることができるようにします。

source: The PixelGetColor function retrieves the color of the pixel at the specified X and Y coordinates.
ja: PixelGetColor関数は、指定した座標のピクセルの色を取得します。

source: The PixelGetColor function retrieves the color of the pixel at the specified x,y coordinates.
ja: PixelGetColor 関数は、指定された x,y 座標にある画素の色を取得します。

source: The PixelSearch function searches a region of the screen for a pixel of the specified color.
ja: PixelSearch関数は、指定された色のピクセルを画面内の領域から検索します。

source: The PostMessage function places a message in the message queue of a window or control.
ja: PostMessage関数は、ウィンドウまたはコントロールのメッセージキューにメッセージを配置します。

source: The ProcessClose function forces the first matching process to close.
ja: ProcessClose関数は、最初にマッチングしたプロセスを強制的に終了させます。

source: The ProcessExist function checks if the specified process exists.
ja: ProcessExist関数は、指定されたプロセスが存在するかどうかをチェックします。

source: The ProcessGetName and ProcessGetPath functions return the name or path of the specified process.
ja: ProcessGetName 関数と ProcessGetPath 関数は、指定されたプロセスの名前またはパスを返します。

source: The ProcessGetParent function returns the process ID (PID) of the process which created the specified process.
ja: ProcessGetParent 関数は、指定されたプロセスを作成したプロセスのプロセス ID（PID）を返します。

source: The ProcessSetPriority function changes the priority level of the first matching process.
ja: ProcessSetPriority関数は、最初にマッチしたプロセスの優先度を変更します。

source: The ProcessWait function waits for the specified process to exist.
ja: ProcessWait 関数は、指定されたプロセスが存在することを待ちます。

source: The ProcessWaitClose function waits for all matching processes to close.
ja: ProcessWaitClose 関数は、一致するすべてのプロセスが終了するのを待ちます。

source: The Program Files directory (e.g. C:\Program Files or C:\Program Files (x86)).
ja: Program Filesディレクトリ（例：C:\Program FilesまたはC:\Program Files (x86)）。

source: The R and T options are mutually exclusive.
ja: RとTのオプションは相互に排他的です。

source: The Random function generates a pseudo-random number.
ja: Random関数は、擬似乱数を生成します。

source: The Raw mode can be enabled with {Raw}, which causes all subsequent characters, including the special characters ^+!#{}, to be interpreted literally rather than translating {Enter} to Enter, ^c to Ctrl+C, etc.
ja: Rawモードは{Raw}で有効にすることができ、{Enter}を Enter、^cを Ctrl+Cなどに変換するのではなく、特殊文字^+!#{}を含む後続のすべての文字が文字通り解釈されるようになります。

source: The Raw mode does not affect the interpretation of escape sequences and expressions.
ja: Rawモードは、エスケープシーケンスや 式の解釈には影響しません。

source: The Recycle Bin has been disabled, such as via the NukeOnDelete registry value.
ja: NukeOnDeleteなどのレジストリ値によってごみ箱は無効化されます。

source: The RegCreateKey function creates a registry key without writing a value.
ja: RegCreateKey関数は、値を書き込むことなくレジストリキーを作成します。

source: The RegDelete function deletes a value from the registry.
ja: RegDelete関数は、レジストリから値を削除する関数です。

source: The RegDeleteKey function deletes a subkey from the registry.
ja: RegDeleteKey関数は、レジストリからサブキーを削除する関数です。

source: The RegExMatch function determines whether a string contains a pattern (regular expression).
ja: RegExMatch 関数は、文字列がパターン（正規表現）を含むかどうかを判定します。

source: The RegExMatch object now supports enumeration (for-loop).
ja: RegExMatch オブジェクトが列挙型（forループ）に対応しました。

source: The RegExReplace function replaces occurrences of a pattern (regular expression) inside a string.
ja: RegExReplace関数は、文字列内のパターン（正規表現）の出現箇所を置き換える関数です。

source: The RegRead function reads a value from the registry.
ja: RegRead 関数は、レジストリから値を読み取ります。

source: The RegWrite function writes a value to the registry.
ja: RegWrite関数は、レジストリに値を書き込む関数です。

source: The Reload function replaces the currently running instance of the script with a new one.
ja: Reload関数は、現在実行中のスクリプトのインスタンスを新しいインスタンスに置き換えます。

source: The Return statement returns from a subroutine to which execution had previously jumped via function-call, Hotkey activation, or other means.
ja: Return文は、関数呼び出しやホットキー操作などでジャンプした先のサブルーチンから戻る文です。

source: The Right Tools
ja: 適切なツール

source: The Run and RunWait functions run an external program.
ja: Run関数とRunWait関数は、外部プログラムを実行します。
